tap "caskroom/cask"
# upgrade casks
tap "buo/cask-upgrade"

brew "awscli"
brew "bash-completion"
brew "bash-git-prompt"
brew "brew-cask-completion"
brew "git-flow"
brew "go"
brew "h2"
brew "httpie"
brew "hub"
brew "jq"
brew "kubectl"
brew "lynx"
brew "mackup"
brew "mas"
brew "nmap"
brew "node"
brew "pyenv"
brew "rbenv"
brew "ssh-copy-id"
brew "trash"
brew "tree"
brew "vcprompt"
brew "youtube-dl"
brew "wget"

# Cask apps
cask "alfred"
cask "android-file-transfer"
# KO - requires java
#cask "android-sdk"
cask "atom"
cask "box-sync"
cask "charles"
cask "dbeaver-community"
# KO - requires java
#cask "dbvisualizer"
cask "docker"
cask "dropbox"
cask "dupeguru"
cask "dbeaver-community"
cask "enpass"
cask "firefox"
cask "flux"
cask "gimp"
cask "gpgtools"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-hangouts"
# KO - requires cask install xquartz
#cask "inkscape"
cask "intellij-idea"
cask "iterm2"
cask "jd-gui"
cask "jdownloader"
cask "lastpass"
cask "libreoffice"
cask "minikube"
cask "postman"
cask "qbittorrent"
cask "skype"
cask "slack"
cask "soapui"
cask "spectacle"
cask "spotify"
cask "sublime"
cask "telegram"
cask "the-unarchiver"
cask "tunnelblick"
cask "virtualbox"
cask "vlc"
cask "xmind"
cask "wireshark"

# Mac App Store
mas "Be Focused", id: 973134470
# Unavailable
# mas "Gapplin", id: 768053424
mas "Giphy Capture", id: 668208984
# Unavailable
# mas "GIFs", id: 662754936
mas "IP Scanner", id: 404167149
mas "Irvue", id: 1039633667
#mas "SnappyApp", id: 512617038
mas "TweetDeck", id: 485812721
mas "Twitter", id: 409789998
mas "Wallble", id: 549018561
