# upgrade casks
tap "buo/cask-upgrade"
# completions
tap "jenkins-x/jx"
tap "heroku/brew"
tap "homebrew/cask-drivers"

# test github actions in local
brew "act"
brew "ansible"
brew "asciinema"
brew "awscli"
# update bash for macosx - https://apple.stackexchange.com/questions/193411/update-bash-to-version-4-0-on-osx
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "brew-cask-completion"
# tree improved
brew "broot"
# brew UI
brew "cakebrew"
brew "cloc"
brew "clojure"
brew "CleverCloud/homebrew-tap/clever-tools"
# top for docker containers
brew "ctop"
# explore docker images
brew "dive"
brew "drafter"
# better than du
brew "duf"
# better than ls
brew "exa"
# simpler than find
brew "fd"
# better autocomplete?
brew "fig"
# hour screensaver
brew "fliqlo"
# fake log generator
brew "flog"
# better than jq
brew "fx"
# command line finder than find, searching with UI
brew "fzf"
brew "fswatch"
brew "garmin-express"
brew "gist"
brew "git"
brew "git-delta"
brew "git-flow"
brew "gitlab-runner"
brew "go"
brew "google-drive"
brew "h2"
brew "heroku"
cask "hiddenbar"
# hexadecimal viewer
brew "hexyl"
brew "hstr"
brew "htop"
brew "httpie"
brew "httrack"
brew "hub"
brew "ipfs"
# better than jq for searching and navigate .json files
brew "jid"
# also better than jq
brew "jless"
brew "jq"
brew "jmeter"
brew "kubectl"
brew "links"
# better video recording tool
brew "loom"
brew "lynx"
brew "mackup"
brew "mas"

# requires maven, java, etc - sdkman
brew "maven-completion"

brew "minikube"
brew "mockserver"
brew "nmap"
brew "ncdu"
#brew "node"        # not needed , managed by nvm
brew "nvm"
# brew "nodenv"     # replaced by nvm 

# markdown saving notes
brew "obsidian"
# required to have AdoptOpenJDK system-wide (ex: running JDK mission control)
brew "openjdk@11"

brew "putty"
brew "pyenv"
# replacement opensource for Alfred
brew "raycast"
brew "rbenv"
brew "sampler"
# opened files per application
cask "sloth"
brew "ssh-copy-id"
# for using haskell
brew "stack"
brew "terraform"
brew "telnet"
brew "thefuck"
brew "tldr"

# requires Java 1.8+
brew "tomcat"

brew "tor"
brew "trash"
brew "tree"
brew "vault"
brew "vcprompt"

# manage keyboard, windows, etc
brew "xdotool"
brew "yarn"
brew "youtube-dl"
brew "watch"
brew "watchman"
brew "wget"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Cask apps
cask "adobe-acrobat-reader"
cask "alfred"
cask "android-file-transfer"
cask "android-sdk"
cask "atom"
cask "bitwarden"
cask "box-sync"
cask "charles"
# clipboard history
cask "clipy"
cask "coreutils"
cask "dbeaver-community"
cask "dbvisualizer"
cask "discord"
cask "docker"
brew "docker-completion"
cask "dropbox"
cask "dupeguru"
cask "dbeaver-community"
cask "eclipse"
cask "firefox"
cask "flux"
cask "gfxcardstatus"
cask "gimp"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-hangouts"
cask "gpg-suite"
cask "grammarly"
cask "xquartz"
# requires install xquartz
cask "inkscape"
cask "intellij-idea"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jd-gui"
cask "jdownloader"
cask "kitematic"
cask "lastpass"
cask "libreoffice"
cask "meld"
cask "megasync"
cask "opera"
cask "pock"
cask "postman"
cask "protonvpn"
cask "qbittorrent"
cask "robo-3t"
cask "skype"
cask "slack"
cask "soapui"
cask "spectacle"
cask "speedify"
cask "spotify"
cask "sublime-text"
cask "telegram"
cask "the-unarchiver"
cask "tor-browser"
cask "tunnelblick"
cask "tunnelbear"
cask "udeler"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "xmind"
cask "wireshark"

# Mac App Store
mas "Be Focused", id: 973134470
# Unavailable
# mas "Gapplin", id: 768053424
mas "Giphy Capture", id: 668208984
# Unavailable
# mas "GIFs", id: 662754936
mas "IP Scanner", id: 404167149
mas "Irvue", id: 1039633667
#mas "SnappyApp", id: 512617038
mas "TweetDeck", id: 485812721
mas "Twitter", id: 409789998
mas "Wallble", id: 549018561
mas "Microsoft Remote Desktop", id: 1295203466
